virtua/index.org
#+TITLE: Virtua
#+OPTIONS: toc:1 num:nil creator:nil date:nil
#+AUTHOR: Manuel Simoni
#+EMAIL: msimoni@gmail.com

/Virtua/ is a new programming language I'm designing, with:

 * [[http://www.cs.indiana.edu/pub/techreports/TR615.pdf][delimited continuations]] for abstracting control,
 * a [[http://piumarta.com/software/cola/objmodel2.pdf][combined object/lambda architecture]] for abstracting state and behavior,
 * and [[http://www.wpi.edu/Pubs/ETD/Available/etd-090110-124904/unrestricted/jshutt.pdf][lexically-scoped fexprs]] for abstracting form.

What the experts say:

 * /I am now convinced that delimited continuations are a bad idea./
   -- Simon Peyton Jones
 * /Object-oriented programming offers a sustainable way to write
   spaghetti code./ -- Paul Graham
 * /I do not favor frankenprogramming, including fexprs
   (frankenprogramming expressions)./ -- David Barbour

Links:

 * [[https://github.com/manuel/schampignon][Schampignon]], experimental interpreter
 * [[http://subjot.com/manuel/virtua][Latest thinking]], updated regularly
 * [[http://axisofeval.blogspot.com/search/label/virtua][Blog posts]], updated whenever something major happens

------------
