virtua/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Virtua</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-09-06 15:03:24 CEST"/>
<meta name="author" content="Manuel Simoni"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">Virtua</h1>

<p><i>Virtua</i> is a new programming language I'm designing, with:
</p>
<ul>
<li>
<a href="http://www.cs.indiana.edu/pub/techreports/TR615.pdf">delimited continuations</a> for abstracting control,
</li>
<li>
a <a href="http://piumarta.com/software/cola/objmodel2.pdf">combined object/lambda architecture</a> for abstracting state and behavior,
</li>
<li>
and <a href="http://www.wpi.edu/Pubs/ETD/Available/etd-090110-124904/unrestricted/jshutt.pdf">lexically-scoped fexprs</a> for abstracting form.

</li>
</ul>

<p>What the experts say:
</p>
<ul>
<li>
<i>I am now convinced that delimited continuations are a bad idea.</i>
&ndash; Simon Peyton Jones
</li>
<li>
<i>Object-oriented programming offers a sustainable way to write    spaghetti code.</i> &ndash; Paul Graham
</li>
<li>
<i>I do not favor frankenprogramming, including fexprs    (frankenprogramming expressions).</i> &ndash; David Barbour

</li>
</ul>

<p>Links:
</p>
<ul>
<li>
<a href="https://github.com/manuel/schampignon">Schampignon</a>, experimental interpreter
</li>
<li>
<a href="http://subjot.com/manuel/virtua">Latest thinking</a>, updated regularly
</li>
<li>
<a href="http://axisofeval.blogspot.com/search/label/virtua">Blog posts</a>, updated whenever something major happens

</li>
</ul>


<hr/>
<div id="postamble">
<p class="author"> Author: Manuel Simoni
<a href="mailto:msimoni@gmail.com">&lt;msimoni@gmail.com&gt;</a>
</p>
<p class="date"> Date: 2011-09-06 15:03:24 CEST</p>
</div>
</div>
</body>
</html>
